Repository: julienlebren/flutter_packages
Catalog: packages/sign_*/l10n/package_*.arb
Languages: fr

# continueButton
source: Continue
fr: Continuer

# countriesTitle
source: Country / Region
fr: Pays / Région

# emailResetTitle
source: Forgot your password
fr: Mot de passe oublié

# emailResetSubtitle
source: Enter your email and we'll send you a link to reset your password.
fr: Saisissez votre e-mail et nous vous enverrons un lien pour réinitialiser votre mot de passe.

# emailResetSubmitButton
source: Reset your password
fr: Rénitialiser le mot de passe

# emailResetSuccessTitle
source: Please check your email
fr: Vérifiez vos e-mails

# emailResetSuccessDescription
source: We just sent a link at {email} to reset your password.
fr: Nous venons d'envoyer un lien sur {email} un lien pour réinitialiser votre mot de passe.

# errorTitle
source: Oops! Something went wrong...
fr: Aïe ! Il y a eu un problème...

# settingsAccountTitle
source: Account
fr: Compte

# settingsCreateAccountButton
source: Create an account
fr: Créer un compte

# settingsCreateAccountWith
source: Create an account with {supplier}
fr: Créer un compte avec {supplier}

# settingsNoAccount
source: You are currently not logged in, your settings and other data are not saved and may be lost. Tap here to create an account.
fr: Vous n'êtes actuellement pas connecté, vos réglages et autres données ne sont pas sauvegardées et pourraient être perdus. Appuyez ici pour créer un compte.

# settingsDeleteTitle
source: Delete account
fr: Supprimer le compte

# settingsDeleteCaption
source: Your account information, profile, and all data stored in the app will be deleted.
fr: Les informations de votre compte, votre profil, ainsi que toutes les données enregegistrées dans l'app seront supprimées.

# settingsDeleteButton
source: Delete account
fr: Supprimer le compte

# settingsDeleteAlertTitle
source: Are you sure you want to continue ? This action is irreversible.
fr: Supprimer le compte

# settingsEmailSectionTitle
source: Login information
fr: Informations de connexion

# settingsEmailLabel
source: Email address
fr: Adresse e-mail

# settingsEmailTitle
source: Email address
fr: Adresse e-mail

# settingsEmailPlaceholder
source: New email address
fr: Nouvelle adresse e-mail

# settingsPasswordTitle
source: Password
fr: Mot de passe

# settingsPasswordLabel
source: Password
fr: Mot de passe

# settingsPasswordPlaceholder
source: New password
fr: Nouveau mot de passe

# settingsPasswordConfirmationPlaceholder
source: Confirm password
fr: Confirmez le mot de passe

# settingsPasswordEdit
source: Change
fr: Modifier

# settingsPasswordUndefinedCaption
source: You haven't set a password yet, so you won't be able to log in to your account using your email address and password. Only login with third-party account will work.
fr: Vous n'avez pas encore défini de mot de passe, vous ne pourrez donc pas vous connecter à votre compte en utilisant votre adresse e-mail et votre mot de passe. Seule la connexion via un compte tiers sera fonctionnelle.

# settingsThirdPartySectionTitle
source: Login with a third-party account
fr: Connexion via un compte tiers

# settingsThirdPartyConnected
source: Connected
fr: Connecté

# settingsThirdPartyNotConnected
source: Not connected
fr: Non connecté

# settingsThirdPartyCaption
source: You can combine several connection methods to secure access to your account.
fr: Vous pouvez cumuler plusieurs méthodes de connexion afin de sécuriser l'accès à votre compte.

# settingsLogoutButton
source: Logout
fr: Déconnexion

# settingsLogoutConfirmation
source: Are you sure you want to logout?
fr: Êtes-vous sûr de vouloir vous déconnecter ?

# settingsUndefined
source: Not set
fr: Non défini

# signInAnonymously
source: Continue without registration
fr: Continuer sans créer de compte

# signInWith
source: Continue with {supplier}
fr: Continuer avec {supplier}

# signInWithEmail
source: e-mail
fr: un e-mail

# signInWithEmailCreateAccount
source: Not yet registered? Create an account here.
fr: Pas encore inscrit ? Créez un compte.

# signInWithEmailLinkSuccess
source: Check your email, we have sent a sign-in link.
fr: Vérifiez vos e-mails, nous vous avons envoyé un lien pour vous identifier.

# signInWithEmailPlaceholder
source: Email address
fr: Adresse e-mail

# signInWithEmailPasswordPlaceholder
source: Password
fr: Mot de passe

# signInWithEmailForgotPassword
source: Forgot your password?
fr: Mot de passe oublié ?

# signInWithEmailTitle
source: Sign in with e-mail
fr: S'identifier avec un e-mail

# signInWithEmailLinkTitle
source: Sign in with e-mail
fr: S'identifier avec un e-mail

# signInWithEmailRegisterTitle
source: Sign up with e-mail
fr: S'inscrire avec un e-mail

# signInWithEmailAlreadyAccount
source: Already have an account? Sign in here.
fr: Déjà inscrit ? Identifiez-vous ici.

# signInWithEmailRegisterButton
source: Register
fr: Créer un compte

# passwordRequirements
source: The password must meet the following conditions:
fr: Le mot de passe doit remplir les conditions suivantes :

# passwordRequirementMinLength
source: Aleast 6 characters
fr: 6 caractères minimum

# passwordRequirementUppercase
source: At least one capital letter
fr: Au moins une majuscule

# passwordRequirementLowercase
source: At least a lowercase
fr: Au moins une minuscule

# passwordRequirementDigits
source: At least one number
fr: Au moins un chiffre

# passwordRequirementSpecialChars
source: At least one special character
fr: Au moins un caractère spécial

# passwordRequirementMatch
source: Passwords match
fr: La confirmation est identique

# signInWithPhone
source: phone number
fr: un numéro

# signInPhoneTitle
source: Phone Number
fr: Numéro de téléphone

# signInPhoneSubtitle
source: We will send an SMS to confirm your number, it won't cost you nothing.
fr: Nous allons envoyer un SMS pour confirmer votre numéro, cela ne vous coûtera rien.

# signInPhonePlaceholder
source: Example: {example}
fr: Exemple: {example}

# signInPhoneAutoRetrieve
source: You may not need to enter the code as the app will attempt to detect it automatically.
fr: Vous n'aurez peut-être pas besoin de saisir le code car l'application tentera de le détecter automatiquement.

# signInPhoneLoadingDialog
source: Waiting for automatic code detection ...
fr: En attente de la détection automatique du code...

# signInVerificationTitle
source: Number verification
fr: Vérification du numéro

# signInVerificationSubtitle
source: Enter the 6-digit code we sent to {phoneNumber}
fr: Saisissez le code à 6 chiffres que nous avons envoyé au {phoneNumber}

# signInVerificationNotReceived
source: Did not receive the code? Wait {seconds} seconds...
fr: Vous n'avez pas reçu le code ? Attendez {seconds} secondes...

# signInVerificationResend
source: Resend the code
fr: Renvoyer le code

# errorExpiredActionCode
source: This link is no longer valid.
fr: Ce lien a expiré.

# errorInvalidEmail
source: This email address is not valid.
fr: Cette adresse e-mail n'est pas valide.

# errorInvalidVerificationCode
source: Invalid verification code!
fr: Code de vérification non valide !

# errorUserDisabled
source: This account has been disabled.
fr: Ce compte a été désactivé.

# errorUserNotFound
source: There is no account registered with this email address.
fr: Nous n'avons trouvé aucun compte enregistré avec cette adresse e-mail.

# errorWrongPassword
source: Wrong password.
fr: Le mot de passe est incorrect.

# errorEmailAlreadyInUse
source: An account is already registered with this email address.
fr: Un compte existe déjà avec cette adresse e-mail.

# errorCredentialAlreadyInUse
source: An account is already linked to this {provider} account.
fr: Un compte est déjà lié à ce compte {provider}.

# errorWeakPassword
source: This password is not strong enough.
fr: Le mot de passe n'est pas assez complexe.

# errorOperationNotAllowed
source: This operation is not allowed.
fr: Cette opération n'est pas autorisée.

# errorPhoneNotMobile
source: You must enter a mobile phone number.
fr: Vous devez saisir un numéro de téléphone mobile.

# errorUnknown
source: An unknown error has occurred.
fr: Une erreur inconnue est survenue.

# unlinkTitle
source: What do you want to do?
fr: Que souhaitez-vous faire ?

# unlinkProvider
source: Disconnect {provider}
fr: Déconnecter {provider}
