Repository: julienlebren/flutter_packages
Catalog: packages/purchases/l10n/package_*.arb
Languages: fr

# annualCaption
source: Annual subscription
fr: Abonnement annuel

# annualPrice
source: {price}/year
fr: {price}/an

# annualDiscount
source: i.e. {discount}% off
fr: soit {discount}% de réduction

# closeAlertTitle
source: A purchase is currently in progress, are you sure you want to leave now?
fr: Un achat est actuellement en cours, êtes-vous sûr de vouloir quitter maintenant ?

# closeAlertCloseButton
source: Yes, leave this view
fr: Oui, quitter cette vue

# closeAlertCancelButton
source: No, wait for the end of the purchase
fr: Non, attendre la fin de l'achat

# cupertinoDisclaimer
source: Payment will be charged to iTunes Account and subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period. Manage auto-renewal by going to the user's Account Settings.
fr: Le paiement sera effectué sur le compte iTunes et l'abonnement se renouvellera automatiquement à moins que le renouvellement automatique ne soit désactivé au moins 24 heures avant la fin de la période en cours. Le compte sera facturé pour le renouvellement dans les 24 heures précédant la fin de la période en cours. Gérez le renouvellement automatique en accédant à l'application Paramètres de votre appareil.

# errorTitle
source: Oops! Something went wrong...
fr: Il y a eu un problème...

# monthlyCaption
source: Monthly subscription
fr: Abonnement mensuel

# monthlyPrice
source: {price}/month
fr: {price}/mois

# priceNotLoaded
source: Unable to contact Store at the moment.
fr: Impossible d'accéder au Store pour le moment.

# privacyPolicyButton
source: Privacy policy
fr: Politique de confidentialité

# purchaseInProgress
source: Purchase in progress, please wait...
fr: Achat en cours, veuillez patienter...

# restoreButton
source: Restore purchases
fr: Restaurer les achats

# retryButton
source: Retry
fr: Réessayer

# termsButton
source: Terms of Use
fr: Conditions d'utilisation

# sixMonthCaption
source: 6 months subscription
fr: Abonnement pour 6 mois

# sixMonthPrice
source: {price}/6 months
fr: {price}/6 mois

# threeMonthCaption
source: 3 months subscription
fr: Abonnement pour 3 mois

# threeMonthPrice
source: {price}/3 months
fr: {price}/3 mois

# twoMonthCaption
source: 2 months subscription
fr: Abonnement pour 2 mois

# twoMonthPrice
source: {price}/2 months
fr: {price}/2 mois

# weeklyCaption
source: Weekly subscription
fr: Abonnement hebdommadaire

# weeklyPrice
source: {price}/week
fr: {price}/semaine

# noSubscriptionToRestore
source: There is no active subscription to restore.
fr: Il n'y a aucun abonnement actif à restaurer.
